## Question 1

In [10]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)

states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(states, index = states)

obj3 = pd.isnull(obj2)

print(obj1)
print('\n')
print(obj2)
print('\n')
print(obj3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64


California    California
Ohio                Ohio
Oregon            Oregon
Texas              Texas
dtype: object


California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [8]:
obj3['California']

False

In [9]:
x = obj2['California']
obj2['California'] != x

False

In [11]:
obj2['California'] == None

False

In [12]:
import math
math.isnan(obj2['California'])

TypeError: must be real number, not str

## Question 2

In [13]:
import pandas as pd

d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}

S = pd.Series(d)

In [16]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

## Question 4

In [33]:
df = pd.DataFrame([{'Seriel No.' : 1,
      'gre score' : 337,
      'toefl score' : 118},
     {'Seriel No.' : 2,
      'gre score' : 324,
      'toefl score' : 107},
     {'Seriel No.' : 3,
      'gre score' : 316,
      'toefl score' : 104},
     {'Seriel No.' : 4,
      'gre score' : 322,
      'toefl score' : 110},
     {'Seriel No.' : 5,
      'gre score' : 314,
      'toefl score' : 103}])

df = df.set_index('Seriel No.')
df

            gre score  toefl score
Seriel No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [38]:
df.where(df['toefl score'] > 105).dropna()

            gre score  toefl score
Seriel No.
1               337.0        118.0
2               324.0        107.0
4               322.0        110.0

In [39]:
df.where(df['toefl score'] > 105)

            gre score  toefl score
Seriel No.
1               337.0        118.0
2               324.0        107.0
3                 NaN          NaN
4               322.0        110.0
5                 NaN          NaN

In [40]:
df[df['toefl score'] > 105]

            gre score  toefl score
Seriel No.
1                 337          118
2                 324          107
4                 322          110

## Question 6

In [41]:
cities = ['Ohio', 'Colorado', 'Utah', 'New York']
nums = [{'one' : 0,
       'two' : 1,
       'three' : 2,
       'four' : 3},
        {'one' : 4,
       'two' : 5,
       'three' : 6,
       'four' : 7},
        {'one' : 8,
       'two' : 9,
       'three' : 10,
       'four' : 11},
        {'one' : 12,
       'two' : 13,
       'three' : 14,
       'four' : 15},
       ]

df2 = pd.DataFrame(nums, index = cities)
df2

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [48]:
new_df = df2.drop('two')
new_df

KeyError: "['two'] not found in axis"

## Question 7

In [53]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

print(s1)
print('\n')
print(s2)

1    Alice
2     Jack
3    Molly
dtype: object


Alice    1
Jack     2
Molly    3
dtype: int64

In [58]:
s2.iloc[1]

2

In [59]:
s_f = s1.append(s2)
s_f

1        Alice
2         Jack
3        Molly
Alice        1
Jack         2
Molly        3
dtype: object

## Question 9

In [60]:
df3 = pd.DataFrame([{'Seriel No.' : 1,
      'gre score' : 337,
      'toefl score' : 118},
     {'Seriel No.' : 2,
      'gre score' : 324,
      'toefl score' : 107},
     {'Seriel No.' : 3,
      'gre score' : 316,
      'toefl score' : 104},
     {'Seriel No.' : 4,
      'gre score' : 322,
      'toefl score' : 110},
     {'Seriel No.' : 5,
      'gre score' : 314,
      'toefl score' : 103}])

df3 = df3.set_index('Seriel No.')
df3

            gre score  toefl score
Seriel No.
1                 337          118
2                 324          107
3                 316          104
4                 322          110
5                 314          103

In [62]:
df[(df['toefl score'].isin(range(106, 115)))]

            gre score  toefl score
Seriel No.
2                 324          107
4                 322          110

In [63]:
(df['toefl score'] > 105) &(df['toefl score'] < 115)

Seriel No.
1    False
2     True
3    False
4     True
5    False
Name: toefl score, dtype: bool

In [65]:
df[(df['toefl score'] > 105) &(df['toefl score'] < 115)]

            gre score  toefl score
Seriel No.
2                 324          107
4                 322          110

In [67]:
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]

            gre score  toefl score
Seriel No.
2                 324          107
4                 322          110

## Question 10

In [70]:
students = [{'Major' : 'Mathematics',
            'Name' : ' Alice',
            'Age' : 20,
            'Gender' : 'F'},
           {'Major' : 'Sociology',
            'Name' : 'Jack',
            'Age' : 22,
            'Gender' : 'M'}]

students_df = pd.DataFrame(students)
students_df = students_df.set_index('Major')
students_df

               Name  Age Gender
Major
Mathematics   Alice   20      F
Sociology      Jack   22      M

In [78]:
students_df.T['Mathematics']

Name       Alice
Age           20
Gender         F
Name: Mathematics, dtype: object